kernel/mm/memblock/memblock.org
#+TITLE: memblock代码分析
#+AUTHOR: Cauchy(pqy7172@gmail.com)
#+OPTIONS: ^:nil
#+EMAIL: pqy7172@gmail.com
#+HTML_HEAD: <link rel="stylesheet" href="../../../org-manual.css" type="text/css">
在伙伴系统还未就绪前，通过memblock提供一个简单的内存分配功能，本文的分析对象就是memblock．

* 结构体介绍
先引入几个结构体，这些结构体是由上到下的关系．

首先是memblock_type：
#+begin_src c
struct memblock {
	bool bottom_up;  /* is bottom up direction? */
	phys_addr_t current_limit;
	struct memblock_type memory;
	struct memblock_type reserved;
};
#+end_src
bottom_up控制着分配方向，地址是从小到大，还是从大到小．current_limit控制着可以分配的最大地址．而memblock_type是下一级结构体：
#+begin_src c
struct memblock_type {
	unsigned long cnt;
	unsigned long max;
	phys_addr_t total_size;
	struct memblock_region *regions;
	char *name;
};
#+end_src
各成员解释如下：
+ cnt：针对regions数组，当前里面有多少个memblock_region．
+ max：针对regions数组，其最大的容量．
+ total_size：对于regions里的所有memblock_region，其size的和大小．
+ name：memblock_tye的字符串名字，比如memory或者reserved．

最后一层的结构体就是memblock_region：
#+begin_src c
struct memblock_region {
	phys_addr_t base;
	phys_addr_t size;
	enum memblock_flags flags;
#ifdef CONFIG_NUMA
	int nid;
#endif
};
#+end_src
各成员意义如下：
+ base：该region所管理地址范围的起始地址．
+ size：该region所管理地址范围的大小．
+ flags：该region的属性，比如没有特别属性，热插拔等．
+ nid：该region的内存所属哪个NUMA结点．

在memblock.c文件中，全局的定义了memblock类型的实例，其也叫memblock：
#+begin_src c
struct memblock memblock __initdata_memblock = {
	.memory.regions		= memblock_memory_init_regions,
	.memory.cnt		= 1,	/* empty dummy entry */
	.memory.max		= INIT_MEMBLOCK_MEMORY_REGIONS,
	.memory.name		= "memory",

	.reserved.regions	= memblock_reserved_init_regions,
	.reserved.cnt		= 1,	/* empty dummy entry */
	.reserved.max		= INIT_MEMBLOCK_RESERVED_REGIONS,
	.reserved.name		= "reserved",

	.bottom_up		= false,
	.current_limit		= MEMBLOCK_ALLOC_ANYWHERE,
};
#+end_src
可以看到，memory和reserved里的regions分别为memblock_memory_init_regions和memblock_reserved_init_regions，这两个数组是提前定义好的：
#+begin_src c
static struct memblock_region memblock_memory_init_regions[INIT_MEMBLOCK_MEMORY_REGIONS] __initdata_memblock;
static struct memblock_region memblock_reserved_init_regions[INIT_MEMBLOCK_RESERVED_REGIONS] __initdata_memblock;
#+end_src
而INIT_MEMBLOCK_MEMORY_REGIONS和INIT_MEMBLOCK_RESERVED_REGIONS的大小都为128．
__initdata_memblock修饰符号根据是否定义了CONFIG_ARCH_KEEP_MEMBLOCK，来决定是否将这些数据结构放入.meminit.data节中，从而在memblock将控制权转交给伙伴系统后释放这些结构体．

后续的添加region和分配内存主要就是操作regions．
