kernel/mm/memblock/memblock.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2023-11-05 Sun 22:24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>memblock代码分析</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../../../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">memblock代码分析</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0880c13">1. 结构体介绍</a></li>
<li><a href="#org89ec632">2. 添加region</a></li>
<li><a href="#orgce58105">3. 分配内存</a></li>
<li><a href="#orgae03c42">4. 交接给伙伴系统</a></li>
</ul>
</div>
</div>
<p>
在伙伴系统还未就绪前，通过memblock提供一个简单的内存分配功能，本文的分析对象就是memblock．
</p>

<div id="outline-container-org0880c13" class="outline-2">
<h2 id="org0880c13"><span class="section-number-2">1.</span> 结构体介绍</h2>
<div class="outline-text-2" id="text-1">
<p>
先引入几个结构体，这些结构体是由上到下的关系．
</p>

<p>
首先是memblock_type：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock</span> {
        <span style="color: #7CB8BB;">bool</span> <span style="color: #DFAF8F;">bottom_up</span>;  <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">is bottom up direction?</span><span style="color: #5F7F5F;"> */</span>
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">current_limit</span>;
        <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_type</span> <span style="color: #DFAF8F;">memory</span>;
        <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_type</span> <span style="color: #DFAF8F;">reserved</span>;
};
</pre>
</div>
<p>
bottom_up控制着分配方向，地址是从小到大，还是从大到小．current_limit控制着可以分配的最大地址．而memblock_type是下一级结构体：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_type</span> {
        <span style="color: #7CB8BB;">unsigned</span> <span style="color: #7CB8BB;">long</span> <span style="color: #DFAF8F;">cnt</span>;
        <span style="color: #7CB8BB;">unsigned</span> <span style="color: #7CB8BB;">long</span> <span style="color: #DFAF8F;">max</span>;
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">total_size</span>;
        <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_region</span> *<span style="color: #DFAF8F;">regions</span>;
        <span style="color: #7CB8BB;">char</span> *<span style="color: #DFAF8F;">name</span>;
};
</pre>
</div>
<p>
各成员解释如下：
</p>
<ul class="org-ul">
<li>cnt：针对regions数组，当前里面有多少个memblock_region．</li>
<li>max：针对regions数组，其最大的容量．</li>
<li>total_size：对于regions里的所有memblock_region，其size的和大小．</li>
<li>name：memblock_tye的字符串名字，比如memory或者reserved．</li>
</ul>

<p>
最后一层的结构体就是memblock_region：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_region</span> {
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">base</span>;
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">size</span>;
        <span style="color: #F0DFAF; font-weight: bold;">enum</span> <span style="color: #7CB8BB;">memblock_flags</span> <span style="color: #DFAF8F;">flags</span>;
<span style="color: #94BFF3;">#ifdef</span> CONFIG_NUMA
        <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">nid</span>;
<span style="color: #94BFF3;">#endif</span>
};
</pre>
</div>
<p>
各成员意义如下：
</p>
<ul class="org-ul">
<li>base：该region所管理地址范围的起始地址．</li>
<li>size：该region所管理地址范围的大小．</li>
<li>flags：该region的属性，比如没有特别属性，热插拔等．</li>
<li>nid：该region的内存所属哪个NUMA结点．</li>
</ul>

<p>
在memblock.c文件中，全局的定义了memblock类型的实例，其也叫memblock：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock</span> <span style="color: #DFAF8F;">memblock</span> __initdata_memblock = {
        .memory.regions         = memblock_memory_init_regions,
        .memory.cnt             = 1,    <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">empty dummy entry</span><span style="color: #5F7F5F;"> */</span>
        .memory.max             = INIT_MEMBLOCK_MEMORY_REGIONS,
        .memory.name            = <span style="color: #CC9393;">"memory"</span>,

        .reserved.regions       = memblock_reserved_init_regions,
        .reserved.cnt           = 1,    <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">empty dummy entry</span><span style="color: #5F7F5F;"> */</span>
        .reserved.max           = INIT_MEMBLOCK_RESERVED_REGIONS,
        .reserved.name          = <span style="color: #CC9393;">"reserved"</span>,

        .bottom_up              = <span style="color: #BFEBBF;">false</span>,
        .current_limit          = MEMBLOCK_ALLOC_ANYWHERE,
};
</pre>
</div>
<p>
可以看到，memory和reserved里的regions分别为memblock_memory_init_regions和memblock_reserved_init_regions，这两个数组是提前定义好的：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_region</span> <span style="color: #DFAF8F;">memblock_memory_init_regions</span>[INIT_MEMBLOCK_MEMORY_REGIONS] __initdata_memblock;
<span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_region</span> <span style="color: #DFAF8F;">memblock_reserved_init_regions</span>[INIT_MEMBLOCK_RESERVED_REGIONS] __initdata_memblock;
</pre>
</div>
<p>
而INIT_MEMBLOCK_MEMORY_REGIONS和INIT_MEMBLOCK_RESERVED_REGIONS的大小都为128．
__initdata_memblock修饰符号根据是否定义了CONFIG_ARCH_KEEP_MEMBLOCK，来决定是否将这些数据结构放入.meminit.data节中，从而在memblock将控制权转交给伙伴系统后释放这些结构体．
</p>

<p>
后续的添加region和分配内存主要就是操作regions．
</p>
</div>
</div>
