kernel/mm/memblock/memblock.org
* 添加region
以memblock_add函数为例，来分析一个region添加到memblock.memory.regions的过程：
#+begin_src c
int __init_memblock memblock_add(phys_addr_t base, phys_addr_t size)
{
	phys_addr_t end = base + size - 1;

	memblock_dbg("%s: [%pa-%pa] %pS\n", __func__,
		     &base, &end, (void *)_RET_IP_);

	return memblock_add_range(&memblock.memory, base, size, MAX_NUMNODES, 0);
}
#+end_src
这个函数比较简单，就是计算了end位置在哪，然后根据配置，memblock_dbg会决定是否打印调试信息，关于这点在[[../../debug/kernel-bootparam.html][这篇文章]]有详细介绍．随后以&memblock.memory参数调用了memblock_add_range函数，就是说这段region要添加到memory这个memblock_type的regions中去，下面继续分析memblock_add_range，以下分几种情况来说明添加过程：
1. regions数组为空：
   
   这种情况没有什么特别的处理，直接往regions里的第一个成员赋值就行：
   #+begin_src c
     static int __init_memblock memblock_add_range(struct memblock_type *type,
                                                   phys_addr_t base, phys_addr_t size,
                                                   int nid, enum memblock_flags flags)
     {
             bool insert = false;
             phys_addr_t obase = base;
             phys_addr_t end = base + memblock_cap_size(base, &size);
             int idx, nr_new, start_rgn = -1, end_rgn;
             struct memblock_region *rgn;
     
             if (!size)
                     return 0;
     
             /* special case for empty array */
             if (type->regions[0].size == 0) {
                     WARN_ON(type->cnt != 1 || type->total_size);
                     type->regions[0].base = base;
                     type->regions[0].size = size;
                     type->regions[0].flags = flags;
                     memblock_set_region_node(&type->regions[0], nid);
                     type->total_size = size;
                     return 0;
             }
     }
   #+end_src
 可以看到，判断regions的第一个region的size为0，就代表还没有任何region被添加到regions里，这时直接添加就行．用0可以判断是因为前面定义memblock_region时都是static类型的．

2. 该类情况就是regions里先前已经有region了，这下面又分为三类，分别分析．首先按下图将这三种情况区分出来：
   : base      end   base      end         base      end
   :  |--case1--|     |--case2--|           |--case3--|
   :   ---------       ---------             ---------
   : -----------------------------------------------------
   :                     |                |
   :                   rbase             rend
   解释下此图的意义，首先base-end之间是一个要插入的region，叫做new-rgn，而rbase-rend是原来regions中的一个region的范围，叫做old-rgn．那么new-rgn和old-rgn如图所示有三种位置关系，case1是new-rgn完全小于old-rgn，也就是rbase >= end．case3是new-rgn完全大于old-rgn，也就是rend <= base．case2就是new-rgn卡在rbase之间．下面分析代码：

   #+begin_src c
     for_each_memblock_type(idx, type, rgn) {
             phys_addr_t rbase = rgn->base;
             phys_addr_t rend = rbase + rgn->size;
     
             if (rbase >= end)
                     break;
             if (rend <= base)
                     continue;
             /*
              ,* @rgn overlaps.  If it separates the lower part of new
              ,* area, insert that portion.
              ,*/
             if (rbase > base) {
     #ifdef CONFIG_NUMA
                     WARN_ON(nid != memblock_get_region_node(rgn));
     #endif
                     WARN_ON(flags != rgn->flags);
                     nr_new++;
                     if (insert) {
                             if (start_rgn == -1)
                                     start_rgn = idx;
                             end_rgn = idx + 1;
                             memblock_insert_region(type, idx++, base,
                                                    rbase - base, nid,
                                                    flags);
                     }
             }
             /* area below @rend is dealt with, forget about it */
             base = min(rend, end);
     }
     /* insert the remaining portion */
     if (base < end) {
             nr_new++;
             if (insert) {
                     if (start_rgn == -1)
                             start_rgn = idx;
                     end_rgn = idx + 1;
                     memblock_insert_region(type, idx, base, end - base,
                                            nid, flags);
             }
      }
   #+end_src
   对于case1，直接跳出循环了，跳出循环后的代码会调用memblock_insert_region插入region，这里遇到了memblock_insert_region，就先分析下这个函数然后再继续分析剩余的两个case，因为不论哪种case，都是通过memblock_insert_region来真正的插入region．
   
   #+begin_src c
     static void __init_memblock memblock_insert_region(struct memblock_type *type,
                                                        int idx, phys_addr_t base,
                                                        phys_addr_t size,
                                                        int nid,
                                                        enum memblock_flags flags)
     {
             struct memblock_region *rgn = &type->regions[idx];
     
             BUG_ON(type->cnt >= type->max);
             memmove(rgn + 1, rgn, (type->cnt - idx) * sizeof(*rgn));
             rgn->base = base;
             rgn->size = size;
             rgn->flags = flags;
             memblock_set_region_node(rgn, nid);
             type->cnt++;
             type->total_size += size;
     }
   #+end_src
   参数idx就是这个新region要插入的位置，从regions数组里取出这个memblock_region为rgn．首先使用memove将自rgn起始的memblock_region都往后挪一个位置，以给新的要插入的rgn在idx处腾开位置．后面的几条语句就是执行插入动作了，作用都简单明了．
   
   回过头来继续分析剩下的两种case，先看case 3，当要插入的region完全大于当前循环遍历的region，也即rend
   <= base为case 3时，则继续循环遍历下一个rgn，查看for_each_memblock_type的定义知道：
   #+begin_src c
     #define for_each_memblock_type(i, memblock_type, rgn)	\
             for (i = 0, rgn = &memblock_type->regions[0];	\
                  i < memblock_type->cnt;			\
                  i++, rgn = &memblock_type->regions[i])
   #+end_src
   会更新rgn为下一个，并且idx作为新region的插入位置，也会自增，如果所有已有的region都比新的要插入的region小，那么就意味着在regions数组的末尾插入这个新的region．

   最后就是rbase > base的case 2，这种情况稍微复杂，通过调用memblock_insert_region的参数知道，该情况下，也会新插入一个region，但是它和传进来的base到base+size范围略有不同，而是从base到rbase．而若end在rbase到rend之间的话，那么rbase到end之间的范围就依旧含在当前遍历的old-rgn里，但是还有另外一种情况，那就是end跨过了rend，也就是end >= rend，如下图：
   :               base                           end
   :                |------------case2-------------|
   :                 ------------------------------
   : -----------------------------------------------------
   :                     |                |
   :                   rbase             rend
   该情况除了base到rbase之间新插入一个region，而在rend到end之间还会诞生一个region，这就是注释insert the remaining portion所表达的情况，只是注意下，这时的base已经在for_each_memblock_type的最后被取为rend和end的最小者．

除了通过memblock_add向memblock.memory添加region，另有一个接口memblock_reserve，会向memblock.reserved添加region，与memblock_add唯一的不同就是其第一个参数是memblock.reserved，后续分配内存以及伙伴系统里都会避开添加到memblock.reserved中的内存范围．
   
最后，何时memblock_add会被调用呢？以x86架构为例，在e820__memblock_setup函数中会遍历e820_table，然后逐个对里面的e820_entry调用memblock_add以添加region．关于这部分的细节请参考文档[[../phy-mem.html][物理内存信息获取及初始化]]，里面分x86和arm64分别作了分析．
