kernel/mm/memblock/memblock.html
<div id="outline-container-org89ec632" class="outline-2">
<h2 id="org89ec632"><span class="section-number-2">2.</span> 添加region</h2>
<div class="outline-text-2" id="text-2">
<p>
以memblock_add函数为例，来分析一个region添加到memblock.memory.regions的过程：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">__init_memblock</span> memblock_add(<span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">base</span>, phys_addr_t size)
{
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">end</span> = base + size - 1;

        memblock_dbg(<span style="color: #CC9393;">"%s: [%pa-%pa] %pS\n"</span>, __func__,
                     &amp;base, &amp;end, (<span style="color: #7CB8BB;">void</span> *)_RET_IP_);

        <span style="color: #F0DFAF; font-weight: bold;">return</span> memblock_add_range(&amp;memblock.memory, base, size, MAX_NUMNODES, 0);
}
</pre>
</div>
<p>
这个函数比较简单，就是计算了end位置在哪，然后根据配置，memblock_dbg会决定是否打印调试信息，关于这点在<a href="../../debug/kernel-bootparam.html">这篇文章</a>有详细介绍．随后以&amp;memblock.memory参数调用了memblock_add_range函数，就是说这段region要添加到memory这个memblock_type的regions中去，下面继续分析memblock_add_range，以下分几种情况来说明添加过程：
</p>
<ol class="org-ol">
<li><p>
regions数组为空：
</p>

<p>
这种情况没有什么特别的处理，直接往regions里的第一个成员赋值就行：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">__init_memblock</span> memblock_add_range(<span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_type</span> *<span style="color: #DFAF8F;">type</span>,
                                              <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">base</span>, <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">size</span>,
                                              <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">nid</span>, <span style="color: #F0DFAF; font-weight: bold;">enum</span> <span style="color: #7CB8BB;">memblock_flags</span> <span style="color: #DFAF8F;">flags</span>)
{
        <span style="color: #7CB8BB;">bool</span> <span style="color: #DFAF8F;">insert</span> = <span style="color: #BFEBBF;">false</span>;
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">obase</span> = base;
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">end</span> = base + memblock_cap_size(base, &amp;size);
        <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">idx</span>, <span style="color: #DFAF8F;">nr_new</span>, <span style="color: #DFAF8F;">start_rgn</span> = -1, <span style="color: #DFAF8F;">end_rgn</span>;
        <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_region</span> *<span style="color: #DFAF8F;">rgn</span>;

        <span style="color: #F0DFAF; font-weight: bold;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>size)
                <span style="color: #F0DFAF; font-weight: bold;">return</span> 0;

        <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">special case for empty array</span><span style="color: #5F7F5F;"> */</span>
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (type-&gt;regions[0].size == 0) {
                WARN_ON(type-&gt;cnt != 1 || type-&gt;total_size);
                type-&gt;regions[0].base = base;
                type-&gt;regions[0].size = size;
                type-&gt;regions[0].flags = flags;
                memblock_set_region_node(&amp;type-&gt;regions[0], nid);
                type-&gt;total_size = size;
                <span style="color: #F0DFAF; font-weight: bold;">return</span> 0;
        }
}
</pre>
</div>
<p>
可以看到，判断regions的第一个region的size为0，就代表还没有任何region被添加到regions里，这时直接添加就行．用0可以判断是因为前面定义memblock_region时都是static类型的．
</p></li>

<li><p>
该类情况就是regions里先前已经有region了，这下面又分为三类，分别分析．首先按下图将这三种情况区分出来：
</p>
<pre class="example">
base      end   base      end         base      end
 |--case1--|     |--case2--|           |--case3--|
  ---------       ---------             ---------
-----------------------------------------------------
                    |                |
                  rbase             rend
</pre>

<p>
解释下此图的意义，首先base-end之间是一个要插入的region，叫做new-rgn，而rbase-rend是原来regions中的一个region的范围，叫做old-rgn．那么new-rgn和old-rgn如图所示有三种位置关系，case1是new-rgn完全小于old-rgn，也就是rbase &gt;= end．case3是new-rgn完全大于old-rgn，也就是rend &lt;= base．case2就是new-rgn卡在rbase之间．下面分析代码：
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #93E0E3;">for_each_memblock_type</span>(idx, type, rgn) {
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">rbase</span> = rgn-&gt;base;
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">rend</span> = rbase + rgn-&gt;size;

        <span style="color: #F0DFAF; font-weight: bold;">if</span> (rbase &gt;= end)
                <span style="color: #F0DFAF; font-weight: bold;">break</span>;
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (rend &lt;= base)
                <span style="color: #F0DFAF; font-weight: bold;">continue</span>;
        <span style="color: #5F7F5F;">/*</span>
<span style="color: #7F9F7F;">         * @rgn overlaps.  If it separates the lower part of new</span>
<span style="color: #7F9F7F;">         * area, insert that portion.</span>
<span style="color: #5F7F5F;">         */</span>
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (rbase &gt; base) {
<span style="color: #94BFF3;">#ifdef</span> CONFIG_NUMA
                WARN_ON(nid != memblock_get_region_node(rgn));
<span style="color: #94BFF3;">#endif</span>
                WARN_ON(flags != rgn-&gt;flags);
                nr_new++;
                <span style="color: #F0DFAF; font-weight: bold;">if</span> (insert) {
                        <span style="color: #F0DFAF; font-weight: bold;">if</span> (start_rgn == -1)
                                start_rgn = idx;
                        end_rgn = idx + 1;
                        memblock_insert_region(type, idx++, base,
                                               rbase - base, nid,
                                               flags);
                }
        }
        <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">area below @rend is dealt with, forget about it</span><span style="color: #5F7F5F;"> */</span>
        base = min(rend, end);
}
<span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">insert the remaining portion</span><span style="color: #5F7F5F;"> */</span>
<span style="color: #F0DFAF; font-weight: bold;">if</span> (base &lt; end) {
        nr_new++;
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (insert) {
                <span style="color: #F0DFAF; font-weight: bold;">if</span> (start_rgn == -1)
                        start_rgn = idx;
                end_rgn = idx + 1;
                memblock_insert_region(type, idx, base, end - base,
                                       nid, flags);
        }
 }
</pre>
</div>
<p>
对于case1，直接跳出循环了，跳出循环后的代码会调用memblock_insert_region插入region，这里遇到了memblock_insert_region，就先分析下这个函数然后再继续分析剩余的两个case，因为不论哪种case，都是通过memblock_insert_region来真正的插入region．
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">void</span> <span style="color: #DFAF8F;">__init_memblock</span> memblock_insert_region(<span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_type</span> *<span style="color: #DFAF8F;">type</span>,
                                                   <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">idx</span>, <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">base</span>,
                                                   <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">size</span>,
                                                   <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">nid</span>,
                                                   <span style="color: #F0DFAF; font-weight: bold;">enum</span> <span style="color: #7CB8BB;">memblock_flags</span> <span style="color: #DFAF8F;">flags</span>)
{
        <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_region</span> *<span style="color: #DFAF8F;">rgn</span> = &amp;type-&gt;regions[idx];

        BUG_ON(type-&gt;cnt &gt;= type-&gt;max);
        memmove(rgn + 1, rgn, (type-&gt;cnt - idx) * <span style="color: #F0DFAF; font-weight: bold;">sizeof</span>(*rgn));
        rgn-&gt;base = base;
        rgn-&gt;size = size;
        rgn-&gt;flags = flags;
        memblock_set_region_node(rgn, nid);
        type-&gt;cnt++;
        type-&gt;total_size += size;
}
</pre>
</div>
<p>
参数idx就是这个新region要插入的位置，从regions数组里取出这个memblock_region为rgn．首先使用memove将自rgn起始的memblock_region都往后挪一个位置，以给新的要插入的rgn在idx处腾开位置．后面的几条语句就是执行插入动作了，作用都简单明了．
</p>

<p>
回过头来继续分析剩下的两种case，先看case 3，当要插入的region完全大于当前循环遍历的region，也即rend
&lt;= base为case 3时，则继续循环遍历下一个rgn，查看for_each_memblock_type的定义知道：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #94BFF3;">#define</span> <span style="color: #93E0E3;">for_each_memblock_type</span>(<span style="color: #DFAF8F;">i</span>, <span style="color: #DFAF8F;">memblock_type</span>, <span style="color: #DFAF8F;">rgn</span>)   \
        <span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0, rgn = &amp;memblock_type-&gt;regions[0];   \
             i &lt; memblock_type-&gt;cnt;                    \
             i++, rgn = &amp;memblock_type-&gt;regions[i])
</pre>
</div>
<p>
会更新rgn为下一个，并且idx作为新region的插入位置，也会自增，如果所有已有的region都比新的要插入的region小，那么就意味着在regions数组的末尾插入这个新的region．
</p>

<p>
最后就是rbase &gt; base的case 2，这种情况稍微复杂，通过调用memblock_insert_region的参数知道，该情况下，也会新插入一个region，但是它和传进来的base到base+size范围略有不同，而是从base到rbase．而若end在rbase到rend之间的话，那么rbase到end之间的范围就依旧含在当前遍历的old-rgn里，但是还有另外一种情况，那就是end跨过了rend，也就是end &gt;= rend，如下图：
</p>
<pre class="example">
              base                           end
               |------------case2-------------|
                ------------------------------
-----------------------------------------------------
                    |                |
                  rbase             rend
</pre>

<p>
该情况除了base到rbase之间新插入一个region，而在rend到end之间还会诞生一个region，这就是注释insert the remaining portion所表达的情况，只是注意下，这时的base已经在for_each_memblock_type的最后被取为rend和end的最小者．
</p></li>
</ol>

<p>
除了通过memblock_add向memblock.memory添加region，另有一个接口memblock_reserve，会向memblock.reserved添加region，与memblock_add唯一的不同就是其第一个参数是memblock.reserved，后续分配内存以及伙伴系统里都会避开添加到memblock.reserved中的内存范围．
</p>

<p>
最后，何时memblock_add会被调用呢？以x86架构为例，在e820__memblock_setup函数中会遍历e820_table，然后逐个对里面的e820_entry调用memblock_add以添加region．关于这部分的细节请参考文档<a href="../phy-mem.html">物理内存信息获取及初始化</a>，里面分x86和arm64分别作了分析．
</p>
</div>
</div>
