kernel/mm/memblock/memblock.html
<div id="outline-container-orgce58105" class="outline-2">
<h2 id="orgce58105"><span class="section-number-2">3.</span> 分配内存</h2>
<div class="outline-text-2" id="text-3">
<p>
前面介绍了memblock相关的初始化，主要是添加region，这些region归根结底就是一个内存范围，这些范围划定了起始地址，大小以及哪些范围不能用（memblock.reversed）．本节将介绍使用memblock分配内存的一个主要接口memblock_alloc．
</p>

<p>
memblock_alloc本身较为简单，就是调用了memblock_alloc_try_nid：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">__always_inline</span> <span style="color: #7CB8BB;">void</span> *memblock_alloc(<span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">size</span>, phys_addr_t align)
{
        <span style="color: #F0DFAF; font-weight: bold;">return</span> memblock_alloc_try_nid(size, align, MEMBLOCK_LOW_LIMIT,
                                      MEMBLOCK_ALLOC_ACCESSIBLE, NUMA_NO_NODE);
}
</pre>
</div>
<p>
可以看到提供给用户的接口只有大小和对齐的位置，而memblock_alloc_try_nid本身也很简单，主要是通过memblock_alloc_internal获取起始的地址并且返回这个地址前通过memset将这段空间清零．memblock_alloc_internal自身逻辑也比较简单，一是检查下slab准备好了的话，直接通过kzalloc_node接口获取虚拟地址，如果slab并没有初始化好，就调用memblock_alloc_range_nid获取虚拟地址，也就是通过memblock机制而不是slab的机制，通过memblock_alloc_range_nid获得的地址，还要通过memblock_reserve接口添加到memblock.reserved中，代表该段内存已经分配出去了，后面的分配不能再使用这段内存了，最后通过phys_to_virt转换为虚拟地址并返回．
</p>

<p>
memblock_alloc_range_nid会调用memblock_find_in_range_node获得一个可用的物理地址，后者函数如下：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">__init_memblock</span> memblock_find_in_range_node(<span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">size</span>,
                                        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">align</span>, <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">start</span>,
                                        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">end</span>, <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">nid</span>,
                                        <span style="color: #F0DFAF; font-weight: bold;">enum</span> <span style="color: #7CB8BB;">memblock_flags</span> <span style="color: #DFAF8F;">flags</span>)
{
        <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">pump up @end</span><span style="color: #5F7F5F;"> */</span>
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (end == MEMBLOCK_ALLOC_ACCESSIBLE ||
            end == MEMBLOCK_ALLOC_NOLEAKTRACE)
                end = memblock.current_limit;

        <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">avoid allocating the first page</span><span style="color: #5F7F5F;"> */</span>
        start = max_t(phys_addr_t, start, PAGE_SIZE);
        end = max(start, end);

        <span style="color: #F0DFAF; font-weight: bold;">if</span> (memblock_bottom_up())
                <span style="color: #F0DFAF; font-weight: bold;">return</span> __memblock_find_range_bottom_up(start, end, size, align,
                                                       nid, flags);
        <span style="color: #F0DFAF; font-weight: bold;">else</span>
                <span style="color: #F0DFAF; font-weight: bold;">return</span> __memblock_find_range_top_down(start, end, size, align,
                                                      nid, flags);
}
</pre>
</div>
<p>
就是确定了分配的上限地址end，下限地址start，然后根据增长方向调用不同的函数，以__memblock_find_range_bottom_up为例继续分析：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">__init_memblock</span>
__memblock_find_range_bottom_up(<span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">start</span>, <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">end</span>,
                                <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">size</span>, <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">align</span>, <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">nid</span>,
                                <span style="color: #F0DFAF; font-weight: bold;">enum</span> <span style="color: #7CB8BB;">memblock_flags</span> <span style="color: #DFAF8F;">flags</span>)
{
        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">this_start</span>, <span style="color: #DFAF8F;">this_end</span>, <span style="color: #DFAF8F;">cand</span>;
        <span style="color: #7CB8BB;">u64</span> <span style="color: #DFAF8F;">i</span>;

        for_each_free_mem_range(i, nid, flags, &amp;this_start, &amp;this_end, <span style="color: #BFEBBF;">NULL</span>) {
                this_start = clamp(this_start, start, end);
                this_end = clamp(this_end, start, end);

                cand = round_up(this_start, align);
                <span style="color: #F0DFAF; font-weight: bold;">if</span> (cand &lt; this_end &amp;&amp; this_end - cand &gt;= size)
                        <span style="color: #F0DFAF; font-weight: bold;">return</span> cand;
        }

        <span style="color: #F0DFAF; font-weight: bold;">return</span> 0;
}
</pre>
</div>
<p>
可以看到，for循环里会确定当前遍历时得到的起始地址this_start和结束地址this_end，并且this_sart和this_end要钳入到start到end之间．最后的起始地址还要通过round_up以参数align对齐得到cand，cand才是真正作为候选的可以返回的物理地址，这个物理地址要小于当前循环的this_end，并且this_end到cand之间有足够大小的size，满足这些条件最后才能返回这个cand．那么for_each_free_mem_range就很关键了：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #94BFF3;">#define</span> <span style="color: #93E0E3;">for_each_free_mem_range</span>(<span style="color: #DFAF8F;">i</span>, <span style="color: #DFAF8F;">nid</span>, <span style="color: #DFAF8F;">flags</span>, <span style="color: #DFAF8F;">p_start</span>, <span style="color: #DFAF8F;">p_end</span>, <span style="color: #DFAF8F;">p_nid</span>)   \
        __for_each_mem_range(i, &amp;memblock.memory, &amp;memblock.reserved,   \
                             nid, flags, p_start, p_end, p_nid)
</pre>
</div>
<p>
这里的memblock.memory是指要从这里面的region分配内存，并且排除在memblock.reserved里出现的内存范围，p_start是分配出来的起始地址，而p_end是可以用的截至到结束的位置．继续看__for_each_mem_range：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #94BFF3;">#define</span> <span style="color: #93E0E3;">__for_each_mem_range</span>(<span style="color: #DFAF8F;">i</span>, <span style="color: #DFAF8F;">type_a</span>, <span style="color: #DFAF8F;">type_b</span>, <span style="color: #DFAF8F;">nid</span>, <span style="color: #DFAF8F;">flags</span>,             \
                             <span style="color: #DFAF8F;">p_start</span>, <span style="color: #DFAF8F;">p_end</span>, <span style="color: #DFAF8F;">p_nid</span>)                     \
        <span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0, __next_mem_range(&amp;i, nid, flags, type_a, type_b,    \
                                     p_start, p_end, p_nid);            \
             i != (<span style="color: #7CB8BB;">u64</span>)ULLONG_MAX;                                      \
             __next_mem_range(&amp;i, nid, flags, type_a, type_b,           \
                              p_start, p_end, p_nid))
</pre>
</div>
<p>
从这里可以看到，p_start和p_end随每次调用__next_mem_range而更新，i会一直增大到ULLONG_MAX．那么__next_mem_range又比较关键了：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">__next_mem_range</span>(<span style="color: #7CB8BB;">u64</span> *<span style="color: #DFAF8F;">idx</span>, <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">nid</span>, <span style="color: #F0DFAF; font-weight: bold;">enum</span> <span style="color: #7CB8BB;">memblock_flags</span> <span style="color: #DFAF8F;">flags</span>,
                      <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_type</span> *<span style="color: #DFAF8F;">type_a</span>,
                      <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_type</span> *<span style="color: #DFAF8F;">type_b</span>, <span style="color: #7CB8BB;">phys_addr_t</span> *<span style="color: #DFAF8F;">out_start</span>,
                      <span style="color: #7CB8BB;">phys_addr_t</span> *<span style="color: #DFAF8F;">out_end</span>, <span style="color: #7CB8BB;">int</span> *<span style="color: #DFAF8F;">out_nid</span>)
{
        <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">idx_a</span> = *idx &amp; 0xffffffff;
        <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">idx_b</span> = *idx &gt;&gt; 32;

        <span style="color: #F0DFAF; font-weight: bold;">if</span> (WARN_ONCE(nid == MAX_NUMNODES,
        <span style="color: #CC9393;">"Usage of MAX_NUMNODES is deprecated. Use NUMA_NO_NODE instead\n"</span>))
                nid = NUMA_NO_NODE;

        <span style="color: #F0DFAF; font-weight: bold;">for</span> (; idx_a &lt; type_a-&gt;cnt; idx_a++) {
                <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_region</span> *<span style="color: #DFAF8F;">m</span> = &amp;type_a-&gt;regions[idx_a];

                <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">m_start</span> = m-&gt;base;
                <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">m_end</span> = m-&gt;base + m-&gt;size;
                <span style="color: #7CB8BB;">int</span>         <span style="color: #DFAF8F;">m_nid</span> = memblock_get_region_node(m);

                <span style="color: #F0DFAF; font-weight: bold;">if</span> (should_skip_region(type_a, m, nid, flags))
                        <span style="color: #F0DFAF; font-weight: bold;">continue</span>;

                <span style="color: #F0DFAF; font-weight: bold;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>type_b) {
                        <span style="color: #F0DFAF; font-weight: bold;">if</span> (out_start)
                                *out_start = m_start;
                        <span style="color: #F0DFAF; font-weight: bold;">if</span> (out_end)
                                *out_end = m_end;
                        <span style="color: #F0DFAF; font-weight: bold;">if</span> (out_nid)
                                *out_nid = m_nid;
                        idx_a++;
                        *idx = (<span style="color: #7CB8BB;">u32</span>)idx_a | (<span style="color: #7CB8BB;">u64</span>)idx_b &lt;&lt; 32;
                        <span style="color: #F0DFAF; font-weight: bold;">return</span>;
                }

                <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">scan areas before each reservation</span><span style="color: #5F7F5F;"> */</span>
                <span style="color: #F0DFAF; font-weight: bold;">for</span> (; idx_b &lt; type_b-&gt;cnt + 1; idx_b++) {
                        <span style="color: #F0DFAF; font-weight: bold;">struct</span> <span style="color: #7CB8BB;">memblock_region</span> *<span style="color: #DFAF8F;">r</span>;
                        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">r_start</span>;
                        <span style="color: #7CB8BB;">phys_addr_t</span> <span style="color: #DFAF8F;">r_end</span>;

                        r = &amp;type_b-&gt;regions[idx_b];
                        r_start = idx_b ? r[-1].base + r[-1].size : 0;
                        r_end = idx_b &lt; type_b-&gt;cnt ?
                                r-&gt;base : PHYS_ADDR_MAX;

                        <span style="color: #5F7F5F;">/*</span>
<span style="color: #7F9F7F;">                         * if idx_b advanced past idx_a,</span>
<span style="color: #7F9F7F;">                         * break out to advance idx_a</span>
<span style="color: #5F7F5F;">                         */</span>
                        <span style="color: #F0DFAF; font-weight: bold;">if</span> (r_start &gt;= m_end)
                                <span style="color: #F0DFAF; font-weight: bold;">break</span>;
                        <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">if the two regions intersect, we're done</span><span style="color: #5F7F5F;"> */</span>
                        <span style="color: #F0DFAF; font-weight: bold;">if</span> (m_start &lt; r_end) {
                                <span style="color: #F0DFAF; font-weight: bold;">if</span> (out_start)
                                        *out_start =
                                                max(m_start, r_start);
                                <span style="color: #F0DFAF; font-weight: bold;">if</span> (out_end)
                                        *out_end = min(m_end, r_end);
                                <span style="color: #F0DFAF; font-weight: bold;">if</span> (out_nid)
                                        *out_nid = m_nid;
                                <span style="color: #5F7F5F;">/*</span>
<span style="color: #7F9F7F;">                                 * The region which ends first is</span>
<span style="color: #7F9F7F;">                                 * advanced for the next iteration.</span>
<span style="color: #5F7F5F;">                                 */</span>
                                <span style="color: #F0DFAF; font-weight: bold;">if</span> (m_end &lt;= r_end)
                                        idx_a++;
                                <span style="color: #F0DFAF; font-weight: bold;">else</span>
                                        idx_b++;
                                *idx = (<span style="color: #7CB8BB;">u32</span>)idx_a | (<span style="color: #7CB8BB;">u64</span>)idx_b &lt;&lt; 32;
                                <span style="color: #F0DFAF; font-weight: bold;">return</span>;
                        }
                }
        }

        <span style="color: #5F7F5F;">/* </span><span style="color: #7F9F7F;">signal end of iteration</span><span style="color: #5F7F5F;"> */</span>
        *idx = ULLONG_MAX;
}
</pre>
</div>

<p>
分析这段代码，idx是64位的，高32位idx_b用于索引type_b里regions的补集，这个补集和数学上的补集有点不一样，举例说明，假设原始的regions分布如下：
</p>
<pre class="example">
0:[0-16), 1:[32-48), 2:[128-130)
</pre>

<p>
那么所谓补集就是：
</p>
<pre class="example">
0:[0-0), 1:[16-32), 2:[48-128), 3:[130-MAX)
</pre>


<p>
idx的低32位idx_a用于索引type_a里的regions．
</p>

<p>
最后，像memblock_phys_alloc这样带phys的接口，返回的是物理地址，而memblock_alloc这样不带phys的接口返回的是虚拟地址，但这点区别微不足道，它们最后都会调用memblock_alloc_range_nid．
</p>

<p>
函数首先从循环变量i中取出idx_a和idx_b，有了这两个索引就可以去type_a和type_b里取region了，如果没有给出type_b，就是type_b为NULL的话就很简单了，把从type_a里取出的region的base和(base+end)的值放到out_start和out_end输出并返回即可，当然在返回前还得更新idx_a，进行自增，至于返回的out_start和out_end到底合适不能用不，在返回后的逻辑里有体现，这个之前分析过了．这种没有给出type_b的是最简单的情况．
</p>

<p>
下面分析给出type_b的情况，也就是type_b不为NULL．这意味着从type_a的region里拿到的范围还要在里面排除有type_b里的region的范围．这里的做法是先求type_b里region的补集，然后用这个补集去和type_a里的region进行相交，得出的范围再交给out_start和out_end进行返回．那么如何先求type_b里region的补集呢？这里有个c语言的技巧，某数组元素的指针为r，那么r[-1]就是r前一个元素，但是除开第一个元素不适用这条技巧．利用这个技巧，求解指向type_b里的一个region的指针r，其补集可以写为代码：
</p>
<div class="org-src-container">
<pre class="src src-c">r_start = idx_b ? r[-1].base + r[-1].size : 0;
r_end = idx_b &lt; type_b-&gt;cnt ?
        r-&gt;base : PHYS_ADDR_MAX;
</pre>
</div>
<p>
这样就可以循环遍历type_b里的region了，采用上面的代码对每个region都求出补集，然后求这个补集和type_a里region的交集．求交集就是out_start采用m_start和r_start的较大者，而out_end取m_end和r_end的较小者，就是两个集合都有的部分．最后会更新idx的值，通过比较type_a里region的结束位置m_end和补集的结束位置r_end，看哪个较小，就需要增加一个索引值，最后通过移位和相或组成到idx．当然，如果m_end都小于r_start，也就是二者没有交集，意味着当前来自type_a里的region太小，需要自增idx_a索引去找到下一个来自type_a里的region，以使这个新的region更有可能和补集交上，也就是r_start &gt;= m_end的情况，直接break出循环了．
</p>
</div>
</div>
<div id="outline-container-orgae03c42" class="outline-2">
<h2 id="orgae03c42"><span class="section-number-2">4.</span> 交接给伙伴系统</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(pqy7172@gmail.com)</p>
<p class="date">Created: 2023-11-05 Sun 22:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
